tap "grafana/grafana"
tap "jsattler/tap"
tap "oven-sh/bun"
brew "age"
brew "cmake"
brew "coreutils"
brew "dust"
brew "dysk"
brew "ffmpeg"
brew "fzf"
brew "git"
brew "go"
brew "golangci-lint"
brew "htop"
brew "mas"
brew "nmap"
brew "node"
brew "pgcli"
brew "pipx"
brew "pnpm"
brew "ripgrep"
brew "rust"
brew "rustup"
brew "telnet"
brew "transmission-cli", restart_service: :changed
brew "tree"
brew "vim"
brew "watch"
brew "wget"
brew "yt-dlp"
brew "zsh"
brew "grafana/grafana/alloy"
cask "amneziavpn"
cask "audacity"
cask "balenaetcher"
cask "jsattler/tap/bettercapture"
cask "betterdisplay"
cask "bettertouchtool"
cask "cloudflare-warp"
cask "docker-desktop"
cask "electrum"
cask "font-iosevka"
cask "font-iosevka-term-nerd-font"
cask "iina"
cask "iterm2"
cask "karabiner-elements"
cask "mediamate"
cask "middle"
cask "middleclick"
cask "mullvad-vpn"
cask "obsidian"
cask "pictogram"
cask "raycast"
cask "shottr"
cask "steam"
cask "tailscale-app"
cask "telegram"
cask "thaw"
cask "tor-browser"
cask "visual-studio-code"
cask "xquartz"
mas "Windows App", id: 1295203466
go "github.com/go-delve/delve/cmd/dlv"
go "github.com/roboslone/go-framework/cmd/fexec"
go "github.com/haya14busa/goplay/cmd/goplay"
go "golang.org/x/tools/gopls"
go "github.com/cweill/gotests/gotests"
go "github.com/josharian/impl"
go "github.com/CtrlSpice/otel-desktop-viewer"
go "honnef.co/go/tools/cmd/staticcheck"
cargo "rustlings"
