tap "oven-sh/bun"
brew "buf"
brew "cmake"
brew "coreutils"
brew "ffmpeg"
brew "fzf"
brew "git"
brew "go"
brew "grpcurl"
brew "mas"
brew "node"
brew "pgcli"
brew "pipx"
brew "protobuf"
brew "python@3.10"
brew "rust"
brew "starship"
brew "telnet"
brew "transmission-cli", restart_service: :changed
brew "tree"
brew "vim"
brew "wget"
brew "yt-dlp"
brew "zoxide"
brew "zsh"
cask "audacity"
cask "cloudflare-warp"
cask "docker-desktop"
cask "electrum"
cask "font-iosevka"
cask "iina"
cask "iterm2"
cask "jordanbaird-ice"
cask "karabiner-elements"
cask "mediamate"
cask "middle"
cask "mullvad-vpn"
cask "obsidian"
cask "raycast"
cask "steam"
cask "sublime-text"
cask "telegram"
cask "tor-browser"
mas "Windows App", id: 1295203466
