tap "oven-sh/bun"
brew "buf"
brew "cmake"
brew "coreutils"
brew "ffmpeg"
brew "fzf"
brew "git"
brew "go"
brew "mas"
brew "node"
brew "ollama", restart_service: :changed
brew "pipx"
brew "pnpm"
brew "protobuf"
brew "python@3.10"
brew "rust"
brew "starship"
brew "telnet"
brew "transmission-cli", restart_service: :changed
brew "tree"
brew "vim"
brew "wakeonlan"
brew "wget"
brew "yt-dlp"
brew "zoxide"
brew "zsh"
cask "audacity"
cask "bartender"
cask "battle-net"
cask "cloudflare-warp"
cask "docker-desktop"
cask "electrum"
cask "font-iosevka"
cask "goland"
cask "iina"
cask "iterm2"
cask "karabiner-elements"
cask "mediamate"
cask "middle"
cask "mullvad-vpn"
cask "obsidian"
cask "raycast"
cask "steam"
cask "sublime-text"
cask "telegram"
cask "tor-browser"
cask "vlc"
mas "Windows App", id: 1295203466
vscode "anotherglitchinthematrix.monochrome"
vscode "arcticicestudio.nord-visual-studio-code"
vscode "continue.continue"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "formulahendry.auto-rename-tag"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "golang.go"
vscode "martybegood.single-editor-tabs"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "naumovs.color-highlight"
vscode "pbkit.vscode-pbkit"
vscode "psioniq.psi-header"
vscode "shalldie.background"
vscode "spikespaz.vscode-smoothtype"
vscode "teabyii.ayu"
vscode "thesofakillers.vscode-pbtxt"
